cdpxe/OpenBSDhacks/openportd/openportd.conf.5
.\" Copyright (c) 2006 Steffen Wendzel <steffen (at) wendzel (dot) de>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF MIND, USE, DATA OR PROFITS, WHETHER IN
.\" AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT
.\" OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd October 16, 2006
.Dt OPENPORTD.CONF 8
.Os
.Sh NAME
.Nm openportd.conf
.Nd "Configuration file for openportd"
.Ek
.Sh DESCRIPTION
The file
.Nm
defines all actions that should be taken if a special key for
.Xr openportd 8
is received.
There is one key and one action defined in every line of the file.
The first value of a line has to be the key that should be at least
8 bytes long. The second value is sepparated by a whitespace and
defines the action that should be executed if this key is found.
.Sh SEE ALSO
.Xr openportd 8
